# 👉 List in Python

# 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# l=[1,2,3,4,5,6,7,8,9,10,11,12]
# print(type(l)) # 🎉 output:- <class 'list'>
# print(l[2])  # 🎉 output:- 3

# 👉 nested list

# l=[1,2,3,[4,5,6]]
# print(l[3][1])  # 🎉 output:- 5

# 👉 Mix list

# l=[2,3,"Hello",[3,4,5]]
# print(l[-2])    # 🎉 output:- Hello
# print(l[-1][-2])  # 🎉 output:- 4

# 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# 👉  List slice
# l = [2,3,"Hello",[3,4,5]]
# print(l[0:2]) # 🎉 output:- [2,3]
# print(l[1:]) # 🎉 output:- [3, 'Hello', [3, 4, 5]]


# l = [1,2,3,4,5,6]
# print(l[0::2])  #🎉 output:- [1,3,5]

# 👉  List slice (Reverse)

# l = [1,2,3,4,5,6]
# print(l[-1::-1]) #🎉 output:- [6, 5, 4, 3, 2, 1]
