# 👉 Getting User Input & Type Casting

# 🎏 Funtion:- input(),int(),float(),eval()

# 🌠🌠 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# a = input("Enter the Value1:- ") 
# print(a,type(a)) # 🎉 Output:-  (<class 'str'>)

# 🌠🌠 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# a = int(input("Enter the Value1:- ")) 
# b = int(input("Enter the Value2:- ")) 
# print(a,type(a)) # 🎉 Output:-   (<class 'int'>)
# print(b,type(b)) # 🎉 Output:-   (<class 'int'>)
# print(a + b)

# 🌠🌠 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# a = float(input("Enter the value1: "))
# b = float(input("Enter the value2: "))

# print(a + b);

# 🌠🌠 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

a = eval(input("Enter the value1: ")) # eval:- taken int or float or binary
b = eval(input("Enter the value2: "))

print(a + b);
