# 👉 For Loop

#🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# range(5)
#start=0
#condition < 5
#increment 1
#0 1 2 3 4

# range(1,6)
#start=1
#condition < 6
#increment 1
#1 2 3 4 5

# range(1,6,2)
#start=1
#condition < 6
#increment 2
#1 3 5

#range(10,0,-1)
#start=10
#condition > 0
#decrement 1
#🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# for n in range(5):
#       print(n)
# print()
# for n in range(1,6):
#       print(n)
# print()
# for n in range(1,6,2):
#       print(n)


#🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# ❓ Table print of 2

# for n in range(1,11):
#       print("2 *",n,"=",2*n)


# ❓ reverse print counting

for n in range(10,0,-1):
      print(n);

for n in range(10,-1,-2):
      print(n);
