# 👉 String Iteration

# 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠


# w="Welcome to SuberIQ"
# t =len(w) # length 18
# print(t)
# for a in range(t):
#       print(w[a])


# 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# ❓ Reverse

# w="Welcome to SuberIQ"
# w=w[-1::-1]
# t =len(w) # length 18
# print(t)
# for a in range(t):
#       print(w[a])

# 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# ❓ Reverse

# w="Welcome to SuberIQ"

# t =len(w) # length 18
# print(t)
# for a in range(t-1,-1,-1):
#       print(w[a])


# 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# ❓ print

# w="Welcome to SuberIQ"

# for a in w:
#       print(a)

# 🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠🌠

# ❓ Reverse 

w="Welcome to SuberIQ"
w=w[-1::-1]

for a in w:
      print(a)
